 **Русский** | [English](README.md) | [Português](languages/README_PTBR.md) | [Turkish](languages/README_TR.md)

# MdgWa

Xposed модуль для кастомизации WhatsApp.

## Характеристики

### Кастомизация

|  | Статус |
| ------------- | ------------- |
| Новая тема WhatsApp | ✅ |
| Новый стиль настроек | ✅ |
| Фильтры чатов | ✅ |
| Обводка кнопок | ✅ |
| Новые иконки меню | ✅ |
| Контурные иконки | ✅ |
| Показ имени и описания | ✅ |
| Формат времени AM:PM | ✅ |
| Отображение секунд во времени | ✅ |
| Изменение глобального цвета | ✅ |
| Разделение чатов и групп | ✅ |


### Функции

|  | Статус |
| ------------- | ------------ |
| Просмотр удаленных сообщений | ✅ |
| Просмотр удаленных статусов | ✅ |
| Загрузка статусов | ✅|
| Загрузка одноразовых изображений | ✅ |
| Отправка видео в высоком качестве | ✅ |
| Отправка изображения в высоком качестве | ✅ |

### Конфиденциальность

|  | Статус |
| ------------- | ------------- |
| Скрыть метку пересылки | ✅ |
| Убрать ограничение на пересылку | ✅ |
| Заморозить время последнего посещения | ✅ |
| Скрыть просмотр статуса | ✅ |
| Скрыть просмотр сообщений | ✅ |
| Скрыть уведомления о прочтении | ✅ |
| Скрыть набор текста | ✅ |
| Скрыть запись голосового сообщения | ✅ |
| Отключить однократный просмотр | ✅ |

## Совместимость

- WhatsApp Stable

## Использование

- [Установить LSPosed](https://github.com/LSPosed/LSPosed)
- Загрузить модуль: [Стабильная версия](https://github.com/ItsMadruga/MdgWa/releases/latest) или [Бета версия](https://github.com/ItsMadruga/MdgWa/actions)
- Установить модуль и активировать его в LSPosed
- Перезапустить WhatsApp для применения изменений

## Каналы

- [Telegram](https://t.me/mdgwamodule)
